app/controllers/led_events_controller.rb

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "led_events".* FROM "led_events" WHERE (led_events.scenario_id =1)
SELECT "led_events".* FROM "led_events"
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "parts".* FROM "parts"
SELECT "led_events".* FROM "led_events" WHERE "led_events"."part_id" = ? AND "led_events"."scenario_id" = ?  [["part_id", 1], ["scenario_id", 1]]
---
  def index
    @scenario = Scenario.find(params[:scenario_id])
    @led_events = LedEvent.where("led_events.scenario_id =?", @scenario.id)
    respond_to do |format|
      format.html{
        @rows = []
        @colors = []
        @led_events.each do |event|
          @rows << [ Part.find(event.part_id).name, event.color, event.start_time, event.end_time]

          unless @colors.include? event.color
            @colors << event.color
          end
        end
      }
      format.json{
        @rows = []
        @hash = {}
        Part.all.each do |part|
          @hash[part.id] = []
          @led_events.where(part_id: part.id).each do |event|

INSERT INTO "led_events" ("color", "start_time", "end_time", "part_id", "scenario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["color", "#fc1bd2"], ["start_time", 0], ["end_time", 500], ["part_id", 3], ["scenario_id", 3], ["created_at", "2016-01-20 21:35:40.848153"], ["updated_at", "2016-01-20 21:35:40.848153"]]
---
  def create
    @led_event = LedEvent.new(led_event_params)
    @led_event.scenario_id = params[:scenario_id]

    respond_to do |format|
      if @led_event.save

SELECT  "led_events".* FROM "led_events" WHERE "led_events"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_led_event
      @led_event = LedEvent.find(params[:id])