app/controllers/scenarios_controller.rb

  def index
    @scenarios = Scenario.all
---
SELECT  "scenarios".* FROM "scenarios" WHERE (scenarios.user_id = 1)  ORDER BY created_at asc LIMIT 1

  def create
    @scenario = Scenario.new(scenario_params)
    puts @scenario

    respond_to do |format|
      if @scenario.save
---
INSERT INTO "scenarios" ("name", "user_id", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Scenario 1"], ["user_id", 1], ["time", "5000"], ["created_at", "2016-01-02 17:28:34.847656"], ["updated_at", "2016-01-02 17:28:34.847656"]]

    def set_scenario
      @scenario = Scenario.find(params[:id])
---
SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = $1 LIMIT 1  [["id", 3]]