app/controllers/suits_controller.rb

SELECT "suits".* FROM "suits"
---
  def index
    @suits = Suit.all

INSERT INTO "suits" ("mac_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "mac_id"  [["mac_id", "K4J9"], ["user_id", 1], ["created_at", "2016-01-27 20:59:28.605370"], ["updated_at", "2016-01-27 20:59:28.605370"]]
---
  def create
    @suit = Suit.new(suit_params)

    respond_to do |format|
      if @suit.save

UPDATE "suits" SET "start_time" = $1, "updated_at" = $2 WHERE "suits"."mac_id" = $3  [["start_time", "2016-01-27 14:02:31.013000"], ["updated_at", "2016-01-27 21:05:51.651535"], ["mac_id", "C2A2"]]
---
  def update
    respond_to do |format|
      if @suit.update(suit_params)

DELETE FROM "suits" WHERE "suits"."id" = $1  [["id", 1]]
---
  def destroy
    @suit.destroy

SELECT  "suits".* FROM "suits" WHERE "suits"."mac_id" = $1 LIMIT 1  [["mac_id", "C2A2"]]
---
    def set_suit
      @suit = Suit.find(params[:mac_id])